TestEDT/src/Documents/ПриходДенег/ПриходДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенег</name>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

TestEDT/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>01</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>01.01</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>01.02</code>
      </childItems>
      <childItems>
        <name>ТоварыВПути</name>
        <description>Товары в пути</description>
        <code>01.03</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>01.04</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ОсновноеПроизводство</name>
        <description>Основное производство</description>
        <code>01.05</code>
      </childItems>
      <childItems>
        <name>ОбщехозяйственныеЗатраты</name>
        <description>Общехозяйственные затраты</description>
        <code>01.06</code>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыВыданные</name>
        <description>Кредиты и займы выданные</description>
        <code>01.07</code>
      </childItems>
      <childItems>
        <name>Материалы</name>
        <description>Материалы</description>
        <code>01.08</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>02</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>02.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>02.02</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыПолученные</name>
        <description>Кредиты и займы полученные</description>
        <code>02.03</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Налоги</name>
        <description>Налоги</description>
        <code>02.04</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Агенты</name>
        <description>Агенты</description>
        <code>02.05</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ПрибылиУбытки</name>
      <description>Прибыли убытки</description>
      <code>03</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <extDimensionAccountingFlags>
    <name>СуммарныйРуб</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>СуммарныйВал</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

TestEDT/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Договора</types>
    <types>CatalogRef.Валюты</types>
  </type>
  <predefined>
    <items>
      <name>Контрагент</name>
      <description>Контрагент</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Договор</name>
      <description>Договор</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Договора</types>
      </type>
    </items>
    <items>
      <name>Валюта</name>
      <description>Валюта</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

TestEDT/src/Documents/ПриходДенег/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
// Данный фрагмент построен конструктором.
// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УправленческийОстатки.Субконто2,
	|	УправленческийОстатки.Субконто3,
	|	УправленческийОстатки.СуммаРубОстаток
	|ПОМЕСТИТЬ ВремТ
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Остатки(&Дата, Счет = &Покупатели, &Субконто, Субконто1 = &Контрагент) КАК
	|		УправленческийОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТ.Субконто2 КАК Субконто2,
	|	ВремТ.Субконто3,
	|	ВремТ.СуммаРубОстаток КАК СуммаРубОстаток,
	|	КурсыВалютСрезПоследних.Курс
	|ИЗ
	|	ВремТ КАК ВремТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВремТ.Субконто3
	|			ИЗ
	|				ВремТ КАК ВремТ)) КАК КурсыВалютСрезПоследних
	|		ПО ВремТ.Субконто3 = КурсыВалютСрезПоследних.Валюта
	|ИТОГИ
	|	СУММА(СуммаРубОстаток)
	|ПО
	|	ОБЩИЕ";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Покупатели", ПланыСчетов.Управленческий.Покупатели);
	Субконто = новый массив;
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагент);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договор);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Валюта);
	Запрос.УстановитьПараметр("Субконто", Субконто);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Осталось = Сумма;
	ВыборкаДетальныеЗаписи.Следующий();
	Если ВыборкаДетальныеЗаписи.СуммаРубОстаток < Сумма Тогда
		Отказ=Истина;
		Сообщить("Сумма завышена. Надо = " + ВыборкаДетальныеЗаписи.СуммаРубОстаток);
	КонецЕсли;
	Если Не Отказ Тогда
		Пока Осталось > 0 И ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = Движения.Управленческий.Добавить();
			Движение.Период = Дата;
			Движение.СчетДт = ПланыСчетов.Управленческий.Касса;
			Движение.СчетКт = ПланыСчетов.Управленческий.Покупатели;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент]=Контрагент;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Договор]=ВыборкаДетальныеЗаписи.Субконто2;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Валюта]=ВыборкаДетальныеЗаписи.Субконто3;
			Движение.СуммаРубДт = Мин(Осталось,ВыборкаДетальныеЗаписи.СуммаРубОстаток );
			Движение.СуммаРубКт = Мин(Осталось,ВыборкаДетальныеЗаписи.СуммаРубОстаток );
			Движение.СуммаВалДт = Мин(Осталось,ВыборкаДетальныеЗаписи.СуммаРубОстаток )/ВыборкаДетальныеЗаписи.Курс;
			Движение.СуммаВалКт = Мин(Осталось,ВыборкаДетальныеЗаписи.СуммаРубОстаток )/ВыборкаДетальныеЗаписи.Курс;
			Осталось=Осталось-Движение.СуммаРубДт;
		КонецЦикла;
	КонецЕсли;

	Движения.Управленческий.Записывать = Истина;
	
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
